app/views/treatments/_form.html.erb

SELECT `specialists`.* FROM `specialists` WHERE `specialists`.`person_id` = 3 ORDER BY `specialists`.`id` ASC LIMIT 1
---
  <% end %>
  <% @specialist_name = Specialist.find(params[:specialist_id]).person.name %>