app/views/treatments/index.html.erb

SELECT `treatments`.* FROM `treatments` WHERE `treatments`.`id` = 2 LIMIT 1
---
      <tr>
        <% @t =Treatment.find(treatment.id) %>

SELECT `specialists`.* FROM `specialists` WHERE `specialists`.`person_id` = 3 ORDER BY `specialists`.`id` ASC LIMIT 1
SELECT `treatments`.* FROM `treatments` WHERE `treatments`.`specialist_id` = 1
---
<% if session[:permission] == 1 or session[:permission] == 2 %>
<%= link_to 'New Treatment', controller: "treatments", action: "new", specialist_id: Person.find(session[:id]).specialist.id %>