app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT `answers`.* FROM `answers`