app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients`
---
  def index
    @patients = Patient.all

INSERT INTO `patients` (`created_at`, `person_id`, `targa`, `updated_at`) VALUES ('2014-03-11 23:01:22', 2, 1, '2014-03-11 23:01:22')
---
  def create
    @person = Person.where(:login => params[:patient][:person_id]).last
    @patient = Patient.new(person: @person, targa: params[:patient][:targa])

    respond_to do |format|
      if @patient.save

DELETE FROM `patients` WHERE `patients`.`id` = 1
---
  def destroy
    @patient.destroy

SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 3 LIMIT 1
---
    def set_patient
      @patient = Patient.find(params[:id])