app/controllers/questions_controller.rb

INSERT INTO `questions` (`body`, `created_at`, `patient_id`, `title`, `updated_at`) VALUES ('qweasdasdada', '2014-03-13 22:24:49', 4, 'adas', '2014-03-13 22:24:49')
---
  def create
    if params[:person_id] != nil
      params[:level] = 3
    end
    p = Person.where(login: params[:question][:person_id]).last
    p.id
    @question = Question.new(patient_id: params[:question][:patient_id], person_id: @person_id, title: params[:question][:title], body: params[:question][:body], level: params[:question][:level], reg_date: params[:question][:reg_date])

    respond_to do |format|
      if @question.save

DELETE FROM `questions` WHERE `questions`.`id` = 1
---
  def destroy
    @question.destroy