app/controllers/specialists_controller.rb

  def index
    @specialists = Specialist.all
---
SELECT `specialists`.* FROM `specialists`

  def create
    @specialist = Specialist.new(specialist_params)

    respond_to do |format|
      if @specialist.save
---
INSERT INTO `specialists` (`created_at`, `person_id`, `shift`, `speciality`, `updated_at`) VALUES ('2014-03-11 23:21:21', 3, 'Mañana', 'Medico(a)', '2014-03-11 23:21:21')

    def set_specialist
      @specialist = Specialist.find(params[:id])
---
SELECT `specialists`.* FROM `specialists` WHERE `specialists`.`id` = 1 LIMIT 1