app/controllers/treatments_controller.rb

  def new
    @treatment = Treatment.new
    @patients = Patient.all
    @specialists= Specialist.all
---
SELECT `patients`.* FROM `patients`
SELECT `specialists`.* FROM `specialists`

  def create
    @p
    x = Person.where(login: params[:treatment][:patient_id]).last

    @patient = x.patient.id
    @treatment = Treatment.new(patient_id: @patient, specialist_id: params[:treatment][:specialist_id], treatment_type: params[:treatment][:treatment_type], start_date: params[:treatment][:start_date], end_date: params[:treatment][:end_date], observation: params[:treatment][:observation])

    #@treatment = Treatment.new(treatment_params)

    respond_to do |format|
      if @treatment.save
---
INSERT INTO `treatments` (`created_at`, `end_date`, `observation`, `patient_id`, `specialist_id`, `start_date`, `treatment_type`, `updated_at`) VALUES ('2014-03-11 23:52:25', '2014-03-11', 'El paciente morira irremediablemente', 2, 2, '2010-01-06', 'tuberculosis', '2014-03-11 23:52:25')

    def set_treatment
      @treatment = Treatment.find(params[:id])
---
SELECT `treatments`.* FROM `treatments` WHERE `treatments`.`id` = 2 LIMIT 1