app/controllers/visits_controller.rb

  def index
    if params[:treatment_id] != nil
    t = Treatment.find(params[:treatment_id])
---
SELECT `treatments`.* FROM `treatments` WHERE `treatments`.`id` = 6 LIMIT 1

  def create
    @visit = Visit.new(visit_params)
    @treatment_id = params[:treatment_id]
    session[:treatment_id] = params[:treatment_id]
    respond_to do |format|
      if @visit.save
---
INSERT INTO `visits` (`assistance_date`, `created_at`, `observation`, `state`, `treatment_id`, `updated_at`, `visit_type`) VALUES ('2014-03-12 21:52:00', '2014-03-12 21:53:04', 'El paciente esta empezanod a tener nauseas ', 0, 4, '2014-03-12 21:53:04', 'Exámen')

    def set_visit
      @visit = Visit.find(params[:id])
---
SELECT `visits`.* FROM `visits` WHERE `visits`.`id` = 1 LIMIT 1